app/controllers/customers_controller.rb

  def alphabetized
    @customers = Customer.order('fullname ASC')
---
SELECT "customers".* FROM "customers" ORDER BY fullname ASC

  def missing_email
    @customers = Customer.where(email: [nil,''])
---
SELECT "customers".* FROM "customers" WHERE ("customers"."email" = ? OR "customers"."email" IS NULL)  [["email", ""]]